# 从大数据集中过滤出属于城市 Las Vegas 的数据集

### 最终过滤出来的数据集：Business、Review、Review Text、User、Friend、Checkin

In [1]:
import pandas as pd

## 1. Business

In [2]:
yelp_all_bizes = pd.read_csv('../../dataset/all/business_with_db_id.csv')

In [3]:
len(yelp_all_bizes) # 这里数据量比 MySQL 中少 1 个是因为去掉了一个经度纬度为空的商店

174566

In [4]:
yelp_all_bizes[:5]

,db_id,business_id,stars,review_count,latitude,longitude,city
0,1,--6MefnULPED_I942VcFNA,3.0,37,43.8409,-79.3996,Richmond Hill
1,2,--7zmmkVg-IMGaXbuVd0SQ,4.0,47,35.4371,-80.8437,Huntersville
2,3,--8LPVSo5i0Oo61X01sV9A,4.5,3,33.3795,-111.7280,Gilbert
3,4,--9e1ONYQuAa-CB_Rrw7Tw,4.0,1451,36.1232,-115.1690,Las Vegas
4,5,--9QQLMTbFzLJ_oT-ON3Xw,3.5,11,33.3617,-111.9100,Tempe

In [5]:
yelp_lv_bizes = yelp_all_bizes[yelp_all_bizes.city=='Las Vegas']

In [6]:
# 这里的数据小于 MySQL 中过滤出来的值 26809，是因为数据库中统计的时候不分大小写，所以数据比这里要大，
# 但因为 26809 跟 26777 相差不大，所以这里我们就直接忽略掉其中差异部分了
len(yelp_lv_bizes)

26777

In [7]:
yelp_lv_bizes[:5]

,db_id,business_id,stars,review_count,latitude,longitude,city
3,4,--9e1ONYQuAa-CB_Rrw7Tw,4.0,1451,36.1232,-115.169,Las Vegas
10,11,--DdmeR16TRb3LsjG0ejrQ,3.0,5,36.1143,-115.171,Las Vegas
11,12,--e8PjCNhEz32pprnPhCwQ,3.5,19,36.1589,-115.133,Las Vegas
28,29,--o5BoU7qYMALeVDK6mwVg,3.5,6,36.1016,-115.132,Las Vegas
32,33,--q7kSBRb0vWC8lSkXFByA,4.0,7,36.0167,-115.173,Las Vegas

In [8]:
yelp_lv_bizes.to_csv('../../dataset/las_vegas/business/las_vegas_business_with_db_id.csv', index=False)

## 2. Review

In [9]:
yelp_all_rvs = pd.read_csv('../../dataset/all/review_with_db_id.csv')

In [10]:
len(yelp_all_rvs)

5261644

In [11]:
yelp_all_rvs[:5]

   db_id               review_id  user_db_id  business_db_id  stars  year
0      1  ----X0BIDP9tA49U3RvdSQ      511974          140598      4  2014
1      2  ---0hl58W-sjVTKi5LghGw     1227202           31553      4  2016
2      3  ---3OXpexMp0oAg77xWfYA      999269           92729      5  2012
3      4  ---65iIIGzHj96QnOh89EQ     1108834           20560      5  2015
4      5  ---7WhU-FtzSUOje87Y4uw      786974          171846      5  2016

In [12]:
yelp_lv_rvs = yelp_all_rvs[yelp_all_rvs.business_db_id.isin(yelp_lv_bizes.db_id.values)]

In [13]:
len(yelp_lv_rvs)

1604246

In [14]:
yelp_lv_rvs[:5]

    db_id               review_id  user_db_id  business_db_id  stars  year
2       3  ---3OXpexMp0oAg77xWfYA      999269           92729      5  2012
5       6  ---94vtJ_5o_nikEs6hUjg      313272          122971      5  2014
7       8  ---D6-P4MpS86LYldBfX7w      735101          160943      4  2016
19     20  ---WDP9kwKyVQiw9GTgNmQ     1045600           12131      1  2014
21     22  ---zHMCae68gIbSbtXxD5w      971613           15470      4  2015

In [15]:
yelp_lv_rvs.to_csv('../../dataset/las_vegas/review/las_vegas_review_with_db_id.csv', index=False)

## 3. Review Text

出于效率考虑（review 文本容量大，但读取频率低），在 MySQL 分表的时候将 review 文本内容单独分成一个表，但这些文本内容中含有大量的逗号，若直接从 MySQL 导出成 csv 文件，则因我们的 csv 用逗号来分割字段，导致我们最终无法成功读取该 csv 文件，所以，这里我们下载 Yelp 的 JSON 格式的 review [数据文件](https://www.yelp.com/dataset)，然后用[官方转换工具](https://github.com/Yelp/dataset-examples/blob/master/json_to_csv_converter.py)将其转为 csv 格式，最终再拼凑成一个单独的 review 文本 csv 文件。

In [16]:
yelp_raw_rvs = pd.read_csv('../../dataset/all/review.csv')

In [17]:
yelp_raw_rvs[:5]

,funny,user_id,review_id,text,business_id,stars,date,useful,cool
0,0,bv2nCi5Qv5vroFiqKGopiw,v0i_UHJMo_hPBq9bxWvW4w,"Love the staff, love the meat, love the place....",0W4lkclzZThpx3V65bVgig,5,2016-05-28,0,0
1,0,bv2nCi5Qv5vroFiqKGopiw,vkVSCC7xljjrAI4UGfnKEQ,Super simple place but amazing nonetheless. It...,AEx2SYEUJmTxVVB18LlCwA,5,2016-05-28,0,0
2,0,bv2nCi5Qv5vroFiqKGopiw,n6QzIUObkYshz4dz2QRJTw,Small unassuming place that changes their menu...,VR6GpWIda3SfvPC-lg9H3w,5,2016-05-28,0,0
3,0,bv2nCi5Qv5vroFiqKGopiw,MV3CcKScW05u5LVfF6ok0g,Lester's is located in a beautiful neighborhoo...,CKC0-MOWMqoeWf6s-szl8g,5,2016-05-28,0,0
4,0,bv2nCi5Qv5vroFiqKGopiw,IXvOzsEMYtiJI0CARmj77Q,Love coming here. Yes the place always needs t...,ACFtxLv8pGrrxMm6EgjreA,4,2016-05-28,0,0

In [18]:
yelp_raw_rv_texts = yelp_raw_rvs[['review_id', 'text']]

In [19]:
yelp_raw_rv_texts[:5]

                review_id                                               text
0  v0i_UHJMo_hPBq9bxWvW4w  Love the staff, love the meat, love the place....
1  vkVSCC7xljjrAI4UGfnKEQ  Super simple place but amazing nonetheless. It...
2  n6QzIUObkYshz4dz2QRJTw  Small unassuming place that changes their menu...
3  MV3CcKScW05u5LVfF6ok0g  Lester's is located in a beautiful neighborhoo...
4  IXvOzsEMYtiJI0CARmj77Q  Love coming here. Yes the place always needs t...

In [20]:
yelp_lv_rv_texts = yelp_lv_rvs.join(yelp_raw_rv_texts.set_index('review_id'), on='review_id')

In [21]:
len(yelp_lv_rv_texts)

1604246

In [22]:
yelp_lv_rv_texts[:5]

,db_id,review_id,user_db_id,business_db_id,stars,year,text
2,3,---3OXpexMp0oAg77xWfYA,999269,92729,5,2012,Pizza here made my night... Good people and gr...
5,6,---94vtJ_5o_nikEs6hUjg,313272,122971,5,2014,One of my absolute favorite restaurants! I usu...
7,8,---D6-P4MpS86LYldBfX7w,735101,160943,4,2016,I don't know why this place only has 3 stars b...
19,20,---WDP9kwKyVQiw9GTgNmQ,1045600,12131,1,2014,2Nd time eating here today.1st time was great ...
21,22,---zHMCae68gIbSbtXxD5w,971613,15470,4,2015,From 8/22/15 \n\nThe Regal 18 is located in Vi...

In [23]:
# Rename column
yelp_lv_rv_texts = yelp_lv_rv_texts.rename(index=str, columns={'db_id': 'review_db_id'})

In [24]:
yelp_lv_rv_texts[:5]

,review_db_id,review_id,user_db_id,business_db_id,stars,year,text
2,3,---3OXpexMp0oAg77xWfYA,999269,92729,5,2012,Pizza here made my night... Good people and gr...
5,6,---94vtJ_5o_nikEs6hUjg,313272,122971,5,2014,One of my absolute favorite restaurants! I usu...
7,8,---D6-P4MpS86LYldBfX7w,735101,160943,4,2016,I don't know why this place only has 3 stars b...
19,20,---WDP9kwKyVQiw9GTgNmQ,1045600,12131,1,2014,2Nd time eating here today.1st time was great ...
21,22,---zHMCae68gIbSbtXxD5w,971613,15470,4,2015,From 8/22/15 \n\nThe Regal 18 is located in Vi...

In [25]:
yelp_lv_rv_texts[['review_db_id', 'text']].to_csv('../../dataset/las_vegas/review/las_vegas_review_text_with_db_id.csv', index=False)

## 4. User

### 4.1 Get Las Vegas Users via Review

In [26]:
lv_users = yelp_lv_rvs.user_db_id.unique()

In [27]:
len(lv_users)

506033

In [28]:
lv_users[:5]

array([ 999269,  313272,  735101, 1045600,  971613])

### 4.2 Filter Users

In [29]:
yelp_all_users = pd.read_csv('../../dataset/all/user_with_db_id.csv')

In [30]:
len(yelp_all_users)

1326101

In [31]:
yelp_all_users[:5]

   db_id                 user_id
0      1  ---1lKK3aKOuomHnwAkAow
1      2  ---94vtJ_5o_nikEs6hUjg
2      3  ---cu1hq55BP9DWVXXKHZg
3      4  ---fhiwiwBYrvqhpXgcWDQ
4      5  ---PLwSf5gKdIoVnyRHgBA

In [32]:
yelp_lv_users = yelp_all_users[yelp_all_users.db_id.isin(lv_users)]

In [33]:
len(yelp_lv_users)

506033

In [34]:
yelp_lv_users[:5]

   db_id                 user_id
0      1  ---1lKK3aKOuomHnwAkAow
3      4  ---fhiwiwBYrvqhpXgcWDQ
5      6  ---udAKDsn0yQXmzbWQNSw
6      7  --0kuuLmuYBe3Rmu0Iycww
8      9  --0sXNBv6IizZXuV-nl0Aw

In [35]:
yelp_lv_users.to_csv('../../dataset/las_vegas/user/las_vegas_user_with_db_id.csv', index=False)

## 5. Friend

In [36]:
yelp_all_friends = pd.read_csv('../../dataset/all/friend_with_db_id.csv')

In [37]:
len(yelp_all_friends)

10645356

In [38]:
yelp_all_friends[:5]

   db_id  user_db_id  friend_db_id
0      1      831960        346611
1      2      831960        785396
2     14      619750        553522
3     25      619750        498367
4     26      619750        566124

In [39]:
yelp_lv_friends = yelp_all_friends[(yelp_all_friends.user_db_id.isin(lv_users)) & (yelp_all_friends.friend_db_id.isin(lv_users))]

In [40]:
len(yelp_lv_friends)

5340616

In [41]:
yelp_lv_friends[:5]

    db_id  user_db_id  friend_db_id
42    166      639871       1296012
52    197      639871        798789
56    204      639871        493744
57    205      639871        189553
62    215      639871       1304316

In [42]:
yelp_lv_friends.to_csv('../../dataset/las_vegas/user/las_vegas_friend_with_db_id.csv', index=False)

## 6. Checkin

In [43]:
yelp_all_cks = pd.read_csv('../../dataset/all/checkin_with_db_id.csv')

In [44]:
len(yelp_all_cks)

146350

In [45]:
yelp_all_cks[:5]

   business_db_id  count
0               1    139
1               2    153
2               3      1
3               4   2568
4               5     33

In [46]:
yelp_lv_cks = yelp_all_cks[yelp_all_cks.business_db_id.isin(yelp_lv_bizes.db_id.values)]

In [47]:
len(yelp_lv_cks)

23242

In [48]:
yelp_lv_cks[:5]

    business_db_id  count
3                4   2568
10              11     30
11              12      1
27              33    107
38              48      2

In [49]:
yelp_lv_cks.to_csv('../../dataset/las_vegas/business/las_vegas_checkin_with_db_id.csv', index=False)